<h1 align='center'>Билет 24</h1>

1. Классы в Python — это. Чем отличается класс от объекта?

    **Класс** - кодовая структура и механизм, используемый для реализации новых видов **объектов**, которые поддерживают **наследование**.

    **Класс** - фабрика экземпляров. Атрибуты класса обеспечивают поведение, которое наследуется всеми экземплярами.

    **Класс** - это статическая часть кода, состоящая из атрибутов, которые не меняются во время выполнения программы - наподобие определений методов класса.

    **Объект** - это экземпляр класса. Однако термин object относится к реально существующему экземпляру класса. Каждый объект должен принадлежать классу.

2. Для чего необходимо ключевое слово self в классах?

    **self** - это ни в коем случае не зарезервированное слово. Это просто название переменной.

    В методах класса первый параметр функции по соглашению именуют self, и это ссылка на сам объект этого класса. Но это именно соглашение. Вы вольны называть параметры как угодно.

# Практика

```python
class DataAnalysis:
    '''
    Составить программу, которая изменяет последовательность слов в строке на обратную.
    '''

    def __init__(self, string=None):
        self._string = string
        print(self._getString())

    def _getString(self):
        return ' '.join(self._string.split(" ")[::-1])


task = DataAnalysis('Составить программу, которая изменяет последовательность слов в строке на обратную.')
```
